{
    "Описание задачи": "RealVideoQA – вопросно-ответный закрытый датасет на русском языке для оценки видео-текстовых моделей (Video-LLMs), содержащий вопросы к видеороликам. Комплексно проверяет следующие навыки: общее понимание видео и его деталей, наличие общих и доменных знаний, способность определять точный порядок действий в видео и восстанавливать полную последовательность, возможность подсчета объектов и действий во времени, а также способность связывать действия с соответствующими временными границами в видео. На основе переданных видео и вопроса необходимо выбрать единственно верный вариант ответа из четырех предложенных. Для правильного ответа не требуется прослушивание аудиоряда. Все видеоролики собраны путём краудсорсинга и отсутствуют в открытых источниках.",
    "Мотивация": "Большинство опубликованных бенчмарков в области понимания видео сфокусированы на английском языке, и на текущий момент нет ни одного опубликованного бенчмарка для русского языка. Датасет RealVideoQA призван закрыть этот пробел: он позволяет оценить, насколько эффективно видеомодели способны отвечать на вопросы, требующие понимания видео (задача VideoQA). Данный датасет покрывает проверку как базовых, так и продвинутых способностей моделей в общем понимании видео и его деталей (за исключением восприятия аудиодорожки из видео), понимании вопросов различного типа и возможности выбрать правильный ответ из предложенных вариантов.\n\nВ категории \"общее описание\" требуется ответить на вопрос об основном действии в видео или объекте на главном плане. Вопросы из категории \"детали и атрибуты\" спрашивают о специфике деталей, об объектах на второстепенном плане. В \"общих и доменных знаниях\" содержатся вопросы, требующие как классических повседневных знаний, так и знаний некоторой прикладной области (\"В каком порядке должно готовиться представленное блюдо?\"). К категории \"последовательности действий\" относятся вопросы, проверяющие понимание действий, происходящих на видео, их взаимного следования, а также проверяющие умение восстанавливать эту последовательность. К \"подсчёту\" относятся вопросы, определяющие способность подсчитывать различные объекты, количество повторений действия, разнесенных во времени, и умение выполнять простые арифметические операции с найденным количеством. В категории \"временной интервал\" проверяется способность связывать действия из видео с временными границами (таймкодами видео), в которые происходят эти действия. Таким образом, датасет проверяет ключевые для видеодомена навыки моделей.\n\nПримеры в датасете не требуют понимания аудиоряда видео, это необходимо учитывать при интерпретации оценки.",
    "Создание датасета": "Для создания датасета использовались видеоролики, собранные путём краудсорсинга через телеграм-бот. С помощью платформы TagMe разметчики составляли вопросы и варианты ответов для каждой категории. В каждом примере только один правильный вариант ответа, что исключает неоднозначность. Проведены два этапа валидации разметки аннотаторами с перекрытием 3 и последующая агрегация результатов. В результате агрегации отобраны только те примеры, где все разметчики дали одинаковый ответ. Также была выполнена постобработка для исправления опечаток. Правильные варианты ответов сбалансированы по классам.",
    "Авторы": "Вильдан Сабуров",
     "Human baseline": "Для всех вопросов датасета были получены ответы разметчиков на crowd-source платформе с перекрытием 5. Ответы в свободной форме были нормализованы (регистр, пробелы) для сравнения с эталоном. Агрегированным ответом считался тот, который был выбран большинством (majority vote)."
}