{
    "Описание задачи": "LabTabVQA – вопросно-ответный датасет на русском языке по изображениям с табличными данными из медицинского домена. В данных представлены изображения  двух типов: фотографии и скриншоты (без OCR-слоя). К каждому изображению прилагается вопрос с семью вариантами ответа, где только один – правильный. Вопросы позволяют оценить способности мультимодальных LLM по работе с таблицами, представленными в виде изображений: понимать структуру и содержимое, находить и извлекать данные, анализировать информацию и т.п. Все изображения – это анонимизированные материалы из реальных онлайн-консультаций телемедицинского сервиса.",
    "Мотивация": "Датасет LabTabVQA создан для оценки способности мультимодальных моделей работать с табличной информацией, представленной в виде изображений, на русском языке. Его ключевая цель – оценить способность мультимодальных моделей понимать структуру таблиц, интерпретировать их содержимое, распознавать форматирование, соотносить информацию и делать выводы, пользуясь лишь общими знаниями моделей.\n\nМетодология сбора датасета и построения вопросов не замкнута на определённом домене и может быть применена для расширения набора данных таблицами из смежных областей знаний. Датасет позволит расширить русскоязычные бенчмарки классом задач для оценки способностей моделей анализировать таблицы с точки зрения распознавания содержимого, работы со сложной структурой, иерархией, интерпретацией данных в end-to-end сценариях.",
    "Создание датасета": "Для создания датасета использовались 697 реальных изображений с платформы телемедицинских консультаций.\nПри помощи модели GPT-4o Mini мы разметили изображения по двум бинарным критериям:\n\n- наличие таблицы на изображении;\n\n- фото или скриншот.\n\nОтбор прошло 339 изображений, сбалансированных по типу изображения и размеру таблицы (который также оценивался с помощью GPT-4o Mini). Для 138 примеров вопросы были составлены экспертами, для остальных 201 примеров вопросы были получены при помощи AI-агентной системы, состоящей из следующих компонент:\n\n1. QuestionGenerator (GPT-o4 Mini) на основе изображения и категории вопроса генерирует вопрос-кандидат с 7 вариантами ответа;\n\n2. QuestionQualifier (GPT-o4 Mini) фиксирует правильный ответ из 7 предложенных, либо запрашивает перегенерацию ответов у QuestionGenerator, если не находит правильного варианта;\n\n3. Solver-ы (GPT-4o Mini) трёх уровней сложности (определяемых промптами) отвечают на вопрос и дают обратную связь с пояснением логики ответа;\n\n4. FeedbackEvaluator (GPT-o4 Mini) анализирует ответы и фидбэк Solver-ов и принимает решение: утвердить вопрос или отправить его на перегенерацию (возврат к шагу 1).\n\nСгенерированные примеры валидировались через платформу TagMe (с перекрытием в 3 мнения/ответа) по следующим критериям:\n\n- вопрос составлен по предоставленной на изображении таблице;\n\n- вопрос не требует специфических доменных знаний для ответа (всё есть на изображении/таблице);\n\n- на вопрос невозможно ответить без использования таблицы/изображения.\nАналогично при помощи асессоров выбирался правильный вариант ответа. Правильным ответом считались:\n\n- ответ, предложенный системой генерации вопросов, если с ним согласилось хотя бы 2 из 3 асессоров;\n\n- ответ, выбранный хотя бы 2 из 3 разметчиков, не совпадающий с предложенным системой создания вопросов, но дополнительно валидированный мета-асессором.\n\nВ связи с особенностями выбранной методологии генерации вопросов, датасет и задачи могут быть предвзятыми в сторону семейства моделей GPT-o4.",
    "Human baseline": "Human baseline формировался на основе независимой разметки на платформе TagME, с перекрытием 5. Асессоров просили ответить на полученные вопросы, в инструкцию были добавлены примеры с пояснениями (те же, что и для few-shot). В качестве финального предсказания использовалось majority vote среди ответов асессоров (не менее 3 совпадений из 5), метрика составила 93.9%. В 11 сэмплах (3.35% от всех данных) не удалось набрать 3 совпадающих ответа, поэтому они не учитывались при оценке.",
    "Авторы": "Амина Мифтахова, Иван Свиридов"
}