{
    "Описание задачи": "Видео-текстовый датасет по этике и безопасности ответов ИИ, ruHHH-Video. Нацелен на проверку двух навыков: умений машины анализировать информацию, получаемую из источников разной модальности (текст + видео), и отвечать пользователю более подходящим способом (с точки зрения одной из категорий этики или безопасности), выбирая лучший из двух предложенных вариантов. Вопросы датасета интерпретируются не относительно неких “общих представлений о правильности“, а в контексте конкретной категории вопроса, к которой они приписаны. Основан на логике текстового датасета HHH (1) и его русскоязычной версии в MERA text (2). Категории Honest, Helpful, Harmless (Честный, Полезный и Безвредный), отвечающие за выбор лучшего ответа в предшествующих датасетах, дополнены в новом датасете ещё тремя этическими категориями: Эмпатичный, Соответствующий этикету, Открытый/Непредвзятый.",
    "Мотивация": "Переводные датасеты не всегда адекватно работают при переносе в другую языковую и культурную реальность, и область этики в этом отношении вызывает больше опасений. ruHHH-Video фокусируется на российских реалиях и материале (тексты, видео), ориентированном на российский контекст. Он позволяет увидеть, насколько оптимально модель способна выбрать в ответ на запрос пользователя наиболее честный, непредвзятый, безвредный, эмпатичный, полезный и соответствующий нормам этикета вариант ответа. И предварительно посмотреть, в каком из кластеров каждой из 6 указанных категорий стоит более внимательно поискать возможные проблемы с ответами пользователю.\n\nОграничения\nВидео собраны пользователями, владеющими русским языком и находящимеся в рамках российского культурного контекста, поэтому группы примеров (вопросно-ответных пар) основаны на российской картине мира, с характерными для неё этическими взглядами и связанными с этикой категориями. Поэтому не стоит использовать этот датасет как инструмент валидации в области наднациональной, мультикультурной этики, хотя в датасете и есть разделы “Непредвзятости” и “Безопасности”, сходным образом применимые не только в российских реалиях.\n\nЛюбые видео, вопросы и ответы в датасете не являются призывом к действию, осуждением или оскорблением кого-либо и чего-либо. Авторы датасета преследуют исключительно научные цели, в первую очередь - оценку безопасности и этичности поведения моделей искуственного интеллекта в предложенных ситуациях.",
    "Создание датасета": "Датасет создан из видео, собранных путём краудсорсинга через мобильный бот. Видео проверены на качество и считываемость разметчиками, после чего снабжены вопросно-ответными группами по 6 этическим категориям, которые затем прошли валидацию и редактуру. Вопросы и ответы были составлены разметчиками, находящимися в рамках российского культурного контекста.\n\nБыли рассмотрены следующие этические категории, которые в свою очередь разделяются на подкатегории:\n\nВ категории Empathetic формальная эмпатия проверяется в трёх подкатегориях:\n- animals and plants (к животным и растениям (подобно тесту Войта-Кампфа из романа Филипа Дика “Мечтают ли андроиды об электроовцах”)),\n- human beings (к отдельному человеку или двум-трём конкретным людям),\n- society (к неиндивидуализированным группам из нескольких человек или к сообществам).\n\nВ категории Etiquette проверяется умение учитывать нормы этикета:\n- place and society (правила поведения в определённом месте или сообществе),\n- time and situations (поведенческие нормы в определённое время суток или в определённой ситуации),\n- persone (правила поведения по отношению к отдельной персоне - индивиду, человеку)\n\nВ категории Безвредность (Harmless) модель выбирает наиболее безопасный для пользователя и его окружения ответ в обсуждении ситуаций, чреватых:\n- death (смертью), \n- threat (угрозой увечья/потери), \n- discommode (просто неудобством)\n\nКатегория Helpful, Полезность, требует от модели выбрать более адекватный вариант ответа, который послужит:\n- solution (в виде решения),\n- prevention (в виде профилактики проблемы)\n- development (в виде задаваемого ответом машины вектора к развитию и пользе)\n\nКатегория Honest отражает Честность по отношению к:\n- truth (говорению правды),\n- people (привлечению к обману человека)\n- norm (по отношению к нормам честного поведения)\n\nКатегория непредубеждённости и непредвзятости Открытость (Open) - отсутствие предубеждений по отношению к:\n- groups (группам людей, выделяемым по полу, возрасту, гендеру, вероисповеданию и так далее),\n- personal choice (личностному выбору)\n- objects, places and actions (объектам-местам-действиям)\n\nЭтические подкатегории, описанные ранее использовались для разбиения и балансировки сета, однако каждая подкатегория имеет достаточно небольшой размер(30-40 примеров), поэтому в метаинформации подкатегории не указываются.\n\nК вопросу и видео разметчиками предложены от 2 до 4 вариантов ответа, заранее размеченных от самого лучшего (согласно требованиям категории) к самому худшему. В каждом отдельном задании ответы выдаются модели для сравнения попарно. В итоге в датасете для одной пары “вопрос+видео” может встречаться до 6 примеров с разными комбинациями вариантов ответа. Это позволяет косвенно оценить, насколько хорошо модель справляется как в достаточно понятных, так и в неоднозначных и размытых этических ситуациях.",
    "Авторы": "Денис Шевелев, Александр Харитонов",
    "Human baseline": "Для всех вопросов датасета были получены ответы разметчиков на crowd-source платформе с перекрытием 5. Агрегированным ответом считался тот, который был выбран большинством (majority vote)."
}