{
    "Описание задачи": "{meta[\"dataset_name\"]} – это расширенная версия подзадачи бинарной классификации оригинального английского бенчмарка [WHOOPS!](https://whoops-benchmark.github.io/). Датасет оценивает, способна ли мультимодальная модель обнаруживать нарушения здравого смысла в изображениях. Здесь нарушение здравого смысла – это ситуации, противоречащие типичным нормам реальности. Например, пингвины не могут летать, дети не водят автомобили, посетители не накладывают еду официантам, и так далее. В датасете поровну \"странных\" и обычных изображений.",
    "Мотивация": "Датасет ориентирован на проверку навыков оценки реальности изображения и подходит для оценки любых AI-моделей, способных анализировать изображение. Ключевая оцениваемая способность – это анализ визуальной информации изображения и сопоставление ее с привычными нормами реальности. Метрика оценки качества – accuracy. Так как датасет оценивает фундментальные способности модели оценивать \"реальность\", он будет интересен всем исследователям как один из базовых этапов проверки модели.",
    "Создание датасета": "Датасет был собран на основе оригинального бенчмарка [WHOOPS!](https://whoops-benchmark.github.io/) при помощи итеративной синтетической генерации в стиле [Self-Instruct](https://github.com/yizhongw/self-instruct). Каждый пример в сабсете WHOOPS! для бинарной классификации – это \"странное\" и \"нормальное\" изображение, а также категория противоречия здравому смыслу и описание каждого изображения. Для расширения датасета мы итеративно генерировали новые категории и описания изображений через GPT-4o, используя примеры из WHOOPS! в качестве few-shots. Далее, по сгенерированным описаниям мы генерировали изображения через DALL-E, вручную отфильтровывали неудачные генерации, и добавляли удачные в пул, чтобы использовать их затем как примеры для новых генераций.",
    "Human baseline": "Ручная разметка проходила на платформе Яндекс Задания с перекрытием в 5 аннотаторов. Было размечено 80 контрольных заданий и 10 обучающих. Аннотаторы, не прошедшие как минимум 80% обучения правильно, не допускались до разметки. Аннотаторы, допустившие ошибки хотя бы в 5 контрольных заданиях, отстранялись от разметки. Агрегированным ответом считался тот, который был выбран большинством (majority vote).",
    "Авторы": "Елисей Рыков, Василий Коновалов, Александр Панченко"
}