{
    "Описание задачи": "Датасет состоит из вопросов с выбором ответа, проверяющие комплексное понимание аудио, в том числе речи, неречевых сигналов и музыки. Вопросы датасета составлялись таким образом, чтобы для ответа на них требовалось не только распознавать речь, но и анализировать аудиоситуацию целиком и взаимодействие её компонентов. Используемые аудиофайлы созданы специально для датасета AQUARIA.\n\nВ датасете представлены вопросы 9 типов:\n- Audio scene classification (классификация аудиосцены)\n- Audio captioning (сопоставление аудио с текстовым описанием)\n- Audio comparison (нахождение различий в паре аудио)\n- Audio sequence analysis (анализ цепочки звуковых событий)\n- Emotion recognition (определение эмоций и субъективных характеристик говорящего)\n- Sound QA (вопросы на анализ неречевых сигналов)\n- Speaker characterization (определение объективных характеристик говорящего)\n- Music QA (вопросы на анализ и знания музыки)\n- Music characterization (определение объективных характеристик музыки)",
    "Мотивация": "Методология оценки больших аудио-языковых моделей (large audio language models, LALMs), как и сами такие модели, — относительно новая область исследований. По сравнению с vision-language доменом, существует меньше крупных бенчмарков, объединяющих разнообразные задачи для оценки навыков LALMs. Примерами таких бенчмарков являются [AIR-Bench (02.2024)](https://arxiv.org/abs/2402.07729), [AudioBench (06.2024)](https://arxiv.org/abs/2406.16020) и [MMAU (10.2024)](https://arxiv.org/abs/2410.19168v1). За основу классификации задач на понимание аудио можно принять разделение задач на анализ речи, неречевых сигналов и музыки.\n\nДатасет разработан для оценки LALMs в задачах на русском языке. Для оценки на этом датасете модели необходим аудиоинтерфейс, так как для ответа на вопрос, заданный текстом, требуется анализ связанной с ним аудиодорожки. В датасете представлены вопросы 9 типов, отличающиеся постановкой задачи и тестируемыми способностями моделей. Датасет тестирует 3 группы навыков аудио-языковых моделей: восприятие звука (perception), знания (knowledge) и способность к рассуждению (reasoning).",
    "Создание датасета": "На основании анализа существующих бенчмарков для тестирования языковых моделей с аудиоинтерфейсом были разработаны 9 типов задач, которые тестируют разные группы навыков таких моделей. Для каждого типа эксперты составили сценарии ситуаций с диалогами, фоновыми звуками и музыкой. К сценариям были подобраны вопросы, соответствующие разным постановкам задачи. Для всех сценариев были записаны аудиодорожки в профессиональной студии звукозаписи, с добровольным использованием голосов авторов датасета. Для ряда вопросов по музыке использованы музыкальные треки, созданные с помощью генеративных моделей (suno.com и других).",
    "Авторы": "Ульяна Исаева",
    "Human baseline": "Для всех вопросов датасета были получены ответы разметчиков на crowd-source платформе с перекрытием 5. Агрегированным ответом считался тот, который был выбран большинством (majority vote)."
}