{
    "Описание задачи": "ruMathVQA — мультимодальный датасет, состоящий из школьных математических задач, представленных в виде изображений и вопросов с аннотацией к ним для записи ответа в однозначной форме.",
    "Мотивация": "Датасет представляет собой открытую базу задач для проверки способностей модели понимать изобразительные элементы из школьной математики и геометрии, а также применять знания школьной математики 5-6 класс и геометрии 7-9 класс. Особенностью данного задания является проверка моделей точно следовать сложным математическим форматам ответа (аннотациям), которые подаются на вход вместе с инструкцией. \n\nДатасет предназначается для моделей Vision + Text, которые умеют не только понимать, что изображено, но и обладают некими базовыми знаниями школьной программы. Изображения представлены в том виде (исходный текст задания сохранен внутри картинки), в котором пользователь может прислать в диалоговый чат моделям в переписке. \n\nДанный датасет не проверяет ход решения и не требует вывести рассуждения для задачи — ответом на задачу является короткий ответ числом / формулой. Аннотация служит инструкцией для записи однозначного короткого ответа на задачу в требуемой пользователем форме. Поэтому в качестве метрики используется Accuracy.",
    "Создание датасета": "Для этапа сбора датасета была выделена группа экспертов с базовыми знаниями по математике. Изображения для датасета нарисованы экспертами - аналогично заданиям из школьных учебников по математике и геометрии. Изображения рисовались тремя способами: 1) в редакторе на белом листе синим или черным цветом, 2) на белом листе бумаги синим или черным цветом, печатными или прописными буквами, с или без использования чертежных инструментов, 3) на листе бумаги в клетку синим или черным цветом, печатными или прописными буквами, с или без использования чертежных инструментов. Ответы к задачам были получены путем решения и дискуссии каждой задачи несколькими экспертами. Аннотация, которая содержит формат для однозначной записи ответа на задачу, была размечена вручную экспертом путем выбора из списка вариантов разных аннотаций. К каждой задаче в инструкции добавлен универсальный вопрос “Какой ответ у задачи, изображенной на рисунке?”. \n\nПолученный на предыдущем шаге датасет прошел валидацию с перекрытием 3 штатными разметчиками платформы ABC Elementary. Разметчики проверяли качество изображений, формат ответа и правильность требований аннотации на соответствие с вопросом задачи и формой ответа. По итогам валидации, если хотя бы один разметчик отметил наличие ошибки / плохое качество, данные подвергались ручной редактуре.",
    "Human baseline": "Задания решались отдельно группой экспертов (перекрытие 3) и группой разметчиков без специальной подготовки (перекрытие 5), которые правильно выполнили 80% тестовых задач из 5 и 6 класса. Задачи требовалось решить за ограниченное время: 5 и 6 класс - 4 минуты, 7 класс - 5 минут, 8 класс - 6 минут, 9 класс - 7 минут. Людей просили решить задания без использования интернета и нейросетевых моделей и записать ответ в нужном формате. Ответы в свободной форме были нормализованы (регистр, пробелы) для сравнения с эталоном. Агрегированным ответом считался тот, который был выбран большинством (majority vote).",
    "Авторы": "Александр Капитанов, Петр Суровцев"
}