{
    "Описание задачи": "UniScienceVQA — мультимодальный датасет, состоящий из заданий на проверку экспертных знаний в различных областях науки (фундаментальные, социальные и прикладные науки, культуроведение, бизнес, здоровье и медицина), задания представлены в виде изображений и вопросов с аннотацией к ним. Задания делятся на три группу по варианту ответ: 1) с коротким ответом; 2) с вариантами ответов; 3) с вариантами ответов, на которые нет верного ответа.",
    "Мотивация": "Датасет представляет собой открытую базу задач для проверки способностей модели понимать элементы изображения из университетской программы и профессиональной сферы. Особенностью данного задания является проверка моделей давать короткий и точный ответ, а так же находить правильный ответ из нескольких варинантов ответов. \n\nДатасет предназначается для моделей Vision + Text, которые умеют не только понимать, что изображено, но и обладают экспертными знаниями университетской программы. \n\nДанный датасет не проверяет ход решения и не требует вывести рассуждения для задачи — ответом на задачу является короткий ответ числом / формулой. Аннотация служит инструкцией для записи однозначного короткого ответа на задачу в требуемой пользователем форме. Поэтому в качестве метрики используется Accuracy.",
    "Создание датасета": "Датасет состоит из 25 поддоменов и для сбора данных по каждому поддомену привлекалась группа экспертов с углубленными знаниями в этой области. Изображения для датасета были нарисованы или сфотографированы экспертами. Создание датасета включала два этапа: 1) создание изображение, вопроса и ответа; 2) проверка созданных данных. Аннотация, которая содержит формат для однозначной записи ответа на задачу, была вручную добавлена в соответствии с ответом. К каждой задаче в инструкции добавлен универсальный текст: «Прочитайте вопрос и решите задачу задачу.». В результате на каждый поддомен было собрано 200-400 заданий.",
    "Авторы": "Александр Капитанов, Петр Суровцев",
    "Human baseline": "Для всех вопросов датасета были получены ответы разметчиков на crowd-source платформе с перекрытием 5. Ответы в свободной форме были нормализованы (регистр, пробелы) для сравнения с эталоном. Агрегированным ответом считался тот, который был выбран большинством (majority vote)."
}