{
    "Описание задачи": "NaturalScienceQA представляет собой мультимодальный вопросно-ответный датасет по естественным наукам с базовыми вопросами из школьной программы, основанный на английском датасете [ScienceQA](https://scienceqa.github.io/index.html#home). Датасет содержит вопросы по четырем дисциплинам естественных наук: физика, биология, химия и естествознание. В задании необходимо по изображению и сопроводительному контексту ответить на вопрос, выбрав правильный ответ из представленных. Задания отобраны так, что без изображения невозможно определить правильный вариант ответа.\n\n**Замечание:** особенность датасета заключается в том, что картинки в заданиях могут быть достаточно низкого разрешения. Таким образом, дополнительно исследуется способность модели извлекать информацию из изображений низкого качества, что часто встречается в приложениях (например, пользователь присылает снимок экрана низкого качества).\n\nТестируемые навыки моделей: Visual pattern recognition, Scheme recognition, Expert domain knowledge, Physical property understanding, Static counting, Problem decomposition, Comparative reasoning",
    "Мотивация": "NaturalScienceQA предназначен для оценки способностей моделей решать задачи в мультимодальном контексте. Датасет направлен на оценку мультимодального рассуждения моделей, поскольку задания содержат как текстовые, так и визуальные данные. Основные пользователи NaturalScienceQA — разработчики, занимающиеся исследованиями в области мультимодальных моделей, в частности, в области образования, научных исследований и систем AI для учебных целей. Результаты также могут быть полезны преподавателям для понимания, насколько AI-модели могут имитировать человеческое понимание в образовательных сценариях. Датасет оценивает способность модели понимать научные концепции и применять их для решения конкретных задач.",
    "Создание датасета": "NaturalScienceQA был создан на основе английского датасета [ScienceQA](https://scienceqa.github.io/index.html#home), вопросно-ответного датасета по широкому кругу научных дисциплин. При создании датасета из тестовой части оригинального ScienceQA были отобраны вопросы по четырем естественным дисциплинам, соотвествующие следующим критериям: 1) вопрос содержит изображение, без которого невозможно дать правильный ответ (опираясь только на информацию из пояснительного текста), 2) вопрос соответствует российским реалиям и покрывается школьной программой. После этого отобранные вопросы были переведены с помощью Google Translator API и вручную отредактированы для устранения ошибок и неточностей, допущенных в ходе автоматического перевода. Примеры для few-shot были получены аналогичным образом, но изначально были взяты из валидационной части исходного датасета.",
    "Human baseline": "Задания датасета было предложено решить группе людей без подготовки (перекрытие 5) и группе экспертов (перекрытие 3). Агрегированным ответом считался тот, который был выбран большинством (majority vote).",
    "Авторы": "Мария Тихонова"
}